<html>
<head>
<title>Aide et Tutorial d'Icon Extract</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<script language="JavaScript" type="text/JavaScript">
<!--

function MM_preloadImages() { //v3.0
  var d=document; if(d.images){ if(!d.MM_p) d.MM_p=new Array();
    var i,j=d.MM_p.length,a=MM_preloadImages.arguments; for(i=0; i<a.length; i++)
    if (a[i].indexOf("#")!=0){ d.MM_p[j]=new Image; d.MM_p[j++].src=a[i];}}
}
//-->
</script>
<link href="../../../css/perso.css" rel="stylesheet" type="text/css">
</head>

<body bgcolor="#FFFFFF" link="#669999" vlink="#CCCCCC" alink="#FFFFCC" leftmargin="5" topmargin="0" marginwidth="5" marginheight="0">
<table width="100%" border="0" cellpadding="0" cellspacing="0">
  <tr> 
    <td align="left" valign="bottom"> <p align="center">&nbsp;</p>
      <div align="center"></div>
      <div align="center"></div></td>
    <td align="left" valign="middle"><img src="../Images/Extract/bugs.jpg" width="66" height="30"></td>
  </tr>
  <tr> 
    <td width="1%" height="240" valign="top" class="petis-12"> <p align="justify" class="petis-12"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"><br>
      </p></td>
    <td width="99%" valign="top" class="petis-12"><span class="petis-12-Bleu">Nouvelle 
      version 1.50</span><br> <span class="petis-12-Soulign&eacute;">Correction 
      des bugs suivants :</span><br>
      Correction d'un bug dans la cr&eacute;ation d'un fichier RSC. La valeur 
      rscdata-&gt;rsh_rssize indiquant la taille r&eacute;elle du fichier RSC 
      &eacute;tendue (type 4) est d&eacute;sormais correcte. Interface<br>
      chargeait bien le fichier mais pas Ressource Master.<br>
      L'allocation m&eacute;moire pour visualiser les fichiers RSC est conserv&eacute;e 
      jusqu'&agrave; la fin du programme et non pas lib&eacute;r&eacute;e &agrave; 
      chaque fois que l'on d&eacute;sire voir un nouveau fichier RSC.<br>
      Correction d'un bug lors de l'affichage d'un nouveau th&egrave;me de fen&ecirc;tre 
      ou de bureau (machine non acc&eacute;l&eacute;r&eacute;e). Les allocations 
      m&eacute;moires sont correctement d&eacute;sallou&eacute;es lors des changements 
      des th&egrave;mes du bureau et des fen&ecirc;tres.<br>
      Correction d'un petit bug lors du transfert des ic&ocirc;nes 16 couleurs 
      en 2 couleurs avec NVDI en mode graphique 8 bits. Le mode PX_VGA8 (sous 
      MAGIC MAC) est d&eacute;tect&eacute; avant traitement. Ce mode est diff&eacute;rent 
      du mode PX_ATARI8 et n&eacute;c&eacute;ssite un traitement diff&eacute;rent.<br>
      Correction d'un bug dans le fichier EXTRACT.CFG.<br>
      Le bouton REPERTOIRE de la fen&ecirc;tre principale est effac&eacute; lorsque 
      par d&eacute;faut on charge le fichier EXTRACT.CFG avec une recherche sur 
      des fichiers ICL, DLL, OCX ou ANI.<br>
      Correction d'un bug lors de l'affichage de la fen&ecirc;tre des nouveaut&eacute;s 
      (machine non acc&eacute;l&eacute;r&eacute;e).<br>
      R&eacute;&eacute;criture de la routine ICL TO ICO. Les allocations m&eacute;moires 
      sont initialis&eacute;es au d&eacute;but de la routine et ne font plus planter 
      le programme dans les mode 16, 24 et 32 bits.<br>
      Modification de la routine de traitement sans interface.<br>
      La souris est effac&eacute;e lors du dessin des ic&ocirc;nes.<br>
      Les fichiers RSC sont d&eacute;sormais lisibles avec les bonnes couleurs 
      pour les ic&ocirc;nes en 8 bits quelque soit le mode graphique.<br>
      R&eacute;&eacute;criture da la routine d'affichage des informations.<br>
      Suppression de certaines routines devenues obsol&egrave;tes.<br>
      Correction d'un bug dans les protocoles DRAG &amp; DROP et AV (visible avec 
      la CT60).<br>
      Correction d'un bug s&eacute;rieux dans la gestion du journal des fichiers 
      RSC, r&eacute;criture d'une partie du code.<br> <br> <span class="petis-12-Soulign&eacute;">Bugs 
      connus et restant &agrave; corriger :</span><br>
      Parfois en mode multitache, le s&eacute;lecteur de fichier n'apparait pas 
      imm&eacute;diatement.<br>
      Lors de la sauvegarde des ic&ocirc;nes en 72 x 72 pixels en mode 16 &agrave; 
      32 bits, un crash peut appa&icirc;tre sous Magic.<br> </td>
  </tr>
  <tr> 
    <td height="19" valign="top" class="petis-12"><img src="../../../Images/Bleu.jpg" width="25" height="25"></td>
    <td valign="middle" class="petis-12"><a href="Signaler.htm" target="_parent">Page 
      suivante</a></td>
  </tr>
  <tr> 
    <td height="25" valign="top" class="petis-12"><img src="../../../Images/Bleu.jpg" width="25" height="25"></td>
    <td valign="middle" class="petis-12"><a href="../Index.htm" target="_parent">Retour 
      au menu</a></td>
  </tr>
</table>
</body>
</html>
