<html>
<head>
<title>Aide et Tutorial d'Icon Extract</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<script language="JavaScript" type="text/JavaScript">
<!--

function MM_preloadImages() { //v3.0
  var d=document; if(d.images){ if(!d.MM_p) d.MM_p=new Array();
    var i,j=d.MM_p.length,a=MM_preloadImages.arguments; for(i=0; i<a.length; i++)
    if (a[i].indexOf("#")!=0){ d.MM_p[j]=new Image; d.MM_p[j++].src=a[i];}}
}
//-->
</script>
<link href="../../../css/perso.css" rel="stylesheet" type="text/css">
</head>

<body bgcolor="#FFFFFF" link="#669999" vlink="#CCCCCC" alink="#FFFFCC" leftmargin="5" topmargin="0" marginwidth="5" marginheight="0">
<table width="100%" border="0" cellpadding="0" cellspacing="0">
  <tr> 
    <td height="30" valign="top" class="petis-12-Gras">&nbsp;</td>
    <td valign="middle" class="petis-12"> <div align="left"><img src="../Images/Extract/histo.jpg" width="118" height="30"></div></td>
  </tr>
  <tr> 
    <td height="1242" valign="top" class="petis-12-Gras"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></td>
    <td valign="middle" class="petis-12"><p><span class="petis-12-Bleu">Nouvelle 
        version 1.50</span> (octobre 2004)<br>
        <span class="petis-12-Soulign&eacute;">Correction des bugs suivants :<br>
        </span>Correction d'un bug dans la cr&eacute;ation d'un fichier RSC. La 
        valeur rscdata-&gt;rsh_rssize indiquant la taille r&eacute;elle du fichier 
        RSC &eacute;tendue (type 4) est d&eacute;sormais correcte. Interface<br>
        chargeait bien le fichier mais pas Ressource Master.<br>
        L'allocation m&eacute;moire pour visualiser les fichiers RSC est conserv&eacute;e 
        jusqu'&agrave; la fin du programme et non pas lib&eacute;r&eacute;e &agrave; 
        chaque fois que l'on d&eacute;sire voir un nouveau fichier RSC.<br>
        Correction d'un bug lors de l'affichage d'un nouveau th&egrave;me de fen&ecirc;tre 
        ou de bureau (machine non acc&eacute;l&eacute;r&eacute;e). Les allocations 
        m&eacute;moires sont correctement d&eacute;sallou&eacute;es lors des changements 
        des th&egrave;mes du bureau et des fen&ecirc;tres.<br>
        Correction d'un petit bug lors du transfert des ic&ocirc;nes 16 couleurs 
        en 2 couleurs avec NVDI en mode graphique 8 bits. Le mode PX_VGA8 (sous 
        MAGIC MAC) est d&eacute;tect&eacute; avant traitement. Ce mode est diff&eacute;rent 
        du mode PX_ATARI8 et n&eacute;c&eacute;ssite un traitement diff&eacute;rent.<br>
        Correction d'un bug dans le fichier EXTRACT.CFG.<br>
        Le bouton REPERTOIRE de la fen&ecirc;tre principale est effac&eacute; 
        lorsque par d&eacute;faut on charge le fichier EXTRACT.CFG avec une recherche 
        sur des fichiers ICL, DLL, OCX ou ANI.<br>
        Correction d'un bug lors de l'affichage de la fen&ecirc;tre des nouveaut&eacute;s 
        (machine non acc&eacute;l&eacute;r&eacute;e).<br>
        R&eacute;&eacute;criture de la routine ICL TO ICO. Les allocations m&eacute;moires 
        sont initialis&eacute;es au d&eacute;but de la routine et ne font plus 
        planter le programme dans les mode 16, 24 et 32 bits.<br>
        Modification de la routine de traitement sans interface.<br>
        La souris est effac&eacute;e lors du dessin des ic&ocirc;nes.<br>
        Les fichiers RSC sont d&eacute;sormais lisibles avec les bonnes couleurs 
        pour les ic&ocirc;nes en 8 bits quelque soit le mode graphique.<br>
        R&eacute;&eacute;criture da la routine d'affichage des informations.<br>
        Suppression de certaines routines devenues obsol&egrave;tes.<br>
        Correction d'un bug dans les protocoles DRAG &amp; DROP et AV (visible 
        avec la CT60).<br>
        Correction d'un bug s&eacute;rieux dans la gestion du journal des fichiers 
        RSC, r&eacute;criture d'une partie du code.<br>
        <br>
        <span class="petis-12-Soulign&eacute;">Nouveaut&eacute;s:</span><br>
        Nouveau module d'installation (version 1.2). Si vous utilisez MAGDESK 
        ou JINNEE (avec Magic ou Mint) et que vous lancez l'installation d'Icon 
        Extract avec INSTALL.PRG, un ordre d'ic&ocirc;nification (WM_ALLICONIFY) 
        est envoy&eacute; pour fermer les fen&ecirc;tres du bureau. A la fin du 
        processus, les fen&ecirc;tres seront r&eacute;affich&eacute;es &agrave; 
        leurs positions d'origines. Vous pouvez installer la nouvelle version 
        d'Icon Extract sur une ancienne version. <span class="petis-12-Gras">Une 
        &eacute;tape suppl&eacute;mentaire a &eacute;t&eacute; rajout&eacute;e 
        lors de l'installation</span>. Si le r&eacute;pertoire d'installation 
        existe d&eacute;j&agrave;, son contenu sera supprim&eacute; int&eacute;gralement 
        (ainsi que ses sous-r&eacute;pertoire). Ne sera conserv&eacute; que le 
        contenu de votre licence (si vous vous &ecirc;tes enregistr&eacute;e). 
        Son contenu sera r&eacute;cup&eacute;r&eacute; pour s&eacute;rialiser 
        cette nouvelle version..<br>
        Rapidit&eacute; accrue du traitement des ic&ocirc;nes en 256 couleurs. 
        <span class="petis-12-Gras">Gain de l'ordre de 50% sur la CT60 et de 70% 
        sur Magic MAC-PC (en fonction des librairies d'ic&ocirc;nes)</span>. Ce 
        gain de vitesse est moins visible avec d'autres cartes acc&eacute;l&eacute;ratrices 
        comme la CT2. Le nouvel algorithme de recherche des couleurs proches est 
        plus simple et moins gourmand en calculs.<br>
        Le nombre d'entr&eacute;es disponibles depuis la fen&ecirc;tre des fichiers 
        RSC trait&eacute;s a &eacute;t&eacute; port&eacute; &agrave; 200.<br>
        La fen&ecirc;tre des nouveaut&eacute;s est affich&eacute; en couleurs.<br>
        Indication du Bogomips dans la fen&ecirc;tre d'information et de la version 
        du boot de la flash CT60.<br>
        Sous Magic, le s&eacute;lecteur de fichier de Magic est utilis&eacute; 
        pour tenir compte des noms longs sur des partitions VFAT (appel de fslx_do 
        au lieu de fsel_exinput). Les r&eacute;pertoires cr&eacute;&eacute;s pour 
        le traitement des fichiers ICL, DLL ou ANI ne sont plus tronqu&eacute;s 
        au format TOS 8 + 3.<br>
        Lors du traitement d'un fichier ICL, DLL ou ANI, si la partition du disque 
        est en mode VFAT (32, 64 caract&egrave;res...), les ic&ocirc;nes seront 
        sauvegard&eacute;es sous leurs v&eacute;ritables noms. Dans le cas ou 
        des noms sont en double, ils seront renomm&eacute;s. <br>
        <br>
        <span class="petis-12-Gras">Exemple de noms d'ic&ocirc;nes pour un fichier 
        ICL ou DLL :</span></p>
      <p align="justify"> <span class="petis-12-Gras-Orange">Aqua volume label<br>
        Aqua volume label (1)... </span><br>
        <br>
        <span class="petis-12-Gras">Exemple de noms d'ic&ocirc;nes pour un fichier 
        ANI :</span></p>
      <p align="justify" class="petis-12-Gras-Orange"> Shutlle0001<br>
        Shuttle0002... </p>
      <p align="justify"> <span class="petis-12-Gras">Dans le cas o&ugrave; des 
        caract&egrave;res interdits seraient pr&eacute;sents :</span><br>
        <span class="petis-12-Gras-Orange">* : \ ?</span><br>
        ils seront remplac&eacute;s par un espace. De m&ecirc;me si le premier 
        caract&egrave;re du nom est un espace, il sera remplac&eacute; par le 
        symbole +.<br>
        Si des ic&ocirc;nes n'ont pas de nom associ&eacute;, elles seront sauvegard&eacute;es 
        avec un num&eacute;ro : 00001 &agrave; 9999. La capacit&eacute; du syst&egrave;me 
        de fichier est indiqu&eacute;e dans la fen&ecirc;tre de traitement (12, 
        64... caract&egrave;res). <br>
        Apr&egrave;s avoir trait&eacute; un fichier ICL, DLL ou ANI, le s&eacute;lecteur 
        de fichier conservera comme futur r&eacute;pertoire de recherche, le chemin 
        o&ugrave; se situait le dernier fichier (ICL, DLL ou ANI) trait&eacute; 
        et non celui-ci ajout&eacute; du dernier r&eacute;pertoire cr&eacute;&eacute;.<br>
        Support des fichiers ICL au format Windows XP (32 bits).<br>
        R&eacute;duction et optimisation des allocations m&eacute;moires pour 
        le traitement des ic&ocirc;nes. M&eacute;moire utilis&eacute;e divis&eacute;e 
        par deux. <br>
        Nouvelle fen&ecirc;tre de scan avec la possibilit&eacute; de modifier 
        la s&eacute;lection des tailles d'ic&ocirc;nes &agrave; traiter et de 
        conserver la premi&egrave;re palette ic&ocirc;ne pour l'ensemble des ic&ocirc;nes 
        suivantes. Attention : cela ne fonctionne qu'avec certaines librairies 
        d'ic&ocirc;nes comme l'exemple livr&eacute; DRAWIN.<br>
        Les fichiers RSC sont d&eacute;sormais enregistr&eacute;s au format &eacute;tendu 
        d'Interface (avec sauvegarde de la palette de couleur 8 bits). Les couleurs 
        sont d&eacute;sormais bien restitu&eacute;es dans les modes de 16 &agrave; 
        32 bits.<br>
        Compatibilit&eacute; totale entre Interface et Ressource Master.<br>
        Toutes les versions du programme sont d&eacute;sassembl&eacute;es avec 
        EASY RIDER 4.0 puis r&eacute;assembler avec ASSEMBLE. Cette manipulation 
        permet d'optimiser le programme en taille et en rapidit&eacute;.<br>
        Sous Magic PC, il est souhaitable d'enlever les flags &quot;Load in TT 
        Ram&quot; et &quot;Malloc in TT Ram&quot; du programme. J'ai remarqu&eacute; 
        un gain de vitesse non n&eacute;gligeable. Je pense que cela est du &agrave; 
        l'&eacute;mulation de la TT Ram sur un PC &eacute;quip&eacute; de Magic.<br>
        Choix de l'ic&ocirc;ne &agrave; conserver dans le cas ou celle-ci existe 
        en m&ecirc;me temps dans les modes 8, 24 et 32 bits.<br>
        Le traitement des ic&ocirc;nes en 72, 96 et 128 pixels est de nouveau 
        disponible mais sans le tramage ou le transfert dans les plans de couleurs 
        manquants sous NVDI 5.xx <br>
        Affichage du nom de l'utilisateur enregistr&eacute; dans la fen&ecirc;tre 
        principale.<br>
        Support du protocole CAB et appel du navigateur Internet par un appel 
        shell_write en mode multitache.<br>
        Gestion d'une liste de sites Internet pour t&eacute;l&eacute;charger des 
        ic&ocirc;nes &agrave; l'aide de CAB.<br>
        Mise &agrave; jour du programme par Internet.<br>
        Aide en ligne au format HTML et nouveau fichier ST GUIDE.<br>
        Support de HypView s'il est install&eacute; &agrave; la place de ST-GUIDE.<br>
        Le fond du bureau n'apparait plus en mode multitache.<br>
        Modifications mineures pour la CT60 (test du FPU et mesure de temp&eacute;rature 
        du 68060).<br>
        <br>
      </p></td>
  </tr>
  <tr> 
    <td height="724" valign="top" class="petis-12-Gras"> <div align="center"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></div></td>
    <td valign="top" class="petis-12"><div align="justify"> 
        <p><span class="petis-12-Bleu">Nouvelle version 1.40</span> (juillet 2003)<br>
          <span class="petis-12-Soulign&eacute;">Correction des bugs suivants 
          :</span><br>
          Correction du bug dans le fichier EXTRACT.CFG.<br>
          Correction du bug lors de l'affichage d'un nouveau th&egrave;me de fen&ecirc;tre 
          ou de bureau (machine non acc&eacute;l&eacute;r&eacute;e).<br>
          Correction du bug lors de l'affichage de la fen&ecirc;tre des nouveaut&eacute;s 
          (machine non acc&eacute;l&eacute;r&eacute;e).<br>
          R&eacute;&eacute;criture de la routine ICL TO ICO. Les allocations m&eacute;moires 
          sont initialis&eacute;es au d&eacute;but de la routine et ne font plus 
          planter le programme dans les mode 16, 24 et 32 bits.<br>
          Modification de la routine de traitement sans interface..<br>
          La souris est effac&eacute;e lors du dessin des ic&ocirc;nes.<br>
          Les fichiers RSC sont d&eacute;sormais lisibles avec les bonnes couleurs 
          pour les ic&ocirc;nes en 8 bits quelque soit le mode graphique.<br>
          R&eacute;&eacute;criture da la routine d'affichage des informations.<br>
          Suppression de certaines routines devenues obsol&egrave;tes.<br>
          <br>
          <span class="petis-12-Soulign&eacute;">Bugs connus et restant &agrave; 
          corriger :</span><br>
          Parfois en mode multitache, le s&eacute;lecteur de fichier n'apparait 
          pas imm&eacute;diatement.<br>
          Lors de la sauvegarde des ic&ocirc;nes en 72 x 72 pixels en mode 16 
          &agrave; 32 bits, un crash peut appa&icirc;tre sous Magic.<br>
          <br>
          <span class="petis-12-Soulign&eacute;">Nouveaut&eacute;s:</span><br>
          Nouveau module d'installation.<br>
          Modifications mineures pour la <a href="http://www.czuba-tech.com" target="_blank">CT60</a> 
          (test du FPU et temp&eacute;rature du CPU).<br>
          Toutes les versions du programme sont d&eacute;sassembl&eacute;es avec 
          EASY RIDER 4.0 puis r&eacute;assembler avec ASSEMBLE. Cette manipulation 
          permet d'optimiser le programme en taille et en rapidit&eacute;. Par 
          exemple la version 68000 perd 100 ko et gagne 20 % en rapidit&eacute;. 
          Sous Magic PC, il est souhaitable d'enlever les flags &quot;Load in 
          TT Ram&quot; et &quot;Malloc in TT Ram&quot; du programme. J'ai remarqu&eacute; 
          un gain de vitesse non n&eacute;gligeable. Je pense que cela est du 
          &agrave; l'&eacute;mulation de la TT ram sur un PC &eacute;quip&eacute; 
          de Magic. <br>
          Les fichiers RSC sont d&eacute;sormais enregistr&eacute;s au format 
          &eacute;tendu d'Interface (avec sauvegarde de la palette de couleur 
          8 bits). Les couleurs sont d&eacute;sormais bien restitu&eacute;es dans 
          les modes de 16 &agrave; 32 bits. Compatibilit&eacute; totale entre 
          Interface et Ressource Master.<br>
          Choix de l'ic&ocirc;ne &agrave; conserver dans le cas ou celle-ci existe 
          en m&ecirc;me temps dans les modes 8, 24 et 32 bits.<br>
          Pour le moment, le traitement des ic&ocirc;nes en 72, 96 et 128 pixels 
          n'est plus disponible. Leurs traitements dans les modes de 16 &agrave; 
          32 bits posent des probl&egrave;mes avec les allocations m&eacute;moires 
          avec NVDI.<br>
          Aide en ligne au format HTML.<br>
          Support du protocole CAB et appel du navigateur Internet par un appel 
          shell_write en mode multitache.<br>
          Gestion d'une liste de sites d'ic&ocirc;nes sur Internet.<br>
          Mise &agrave; jour du programme par Internet.<br>
          Affichage de l'enregistrement dans la fen&ecirc;tre principale.<br>
          Support de HypView s'il est install&eacute; &agrave; la place de ST-GUIDE.<br>
          Support des fichiers ICL au format Windows XP (32 bits).<br>
          Le fond du bureau n'apparait plus en mode multitache.<br>
          Nouvelle fen&ecirc;tre de scan avec la possibilit&eacute; de modifier 
          la s&eacute;lection des tailles d'ic&ocirc;nes &agrave; traiter.</p>
        <p><span class="petis-12-Soulign&eacute;">Important :</span><br>
          Pour pouvoir b&eacute;n&eacute;ficier de l'acc&egrave;s Internet depuis 
          ICON Extract, une ligne doit appara&icirc;tre dans vos fichiers de configuration 
          sous Magic, MultiTOS ou NAES. Il s'agit de la variable BROWSER. Celle-ci 
          indique le chemin de votre navigateur Internet.<br>
          <br>
          Exemple pour CAB sous MagiC dans le fichier MAGX.INF : <br>
          #_ENV BROWSER=C:\CAB\CAB.APP<br>
          <br>
          Exemple pour CAB sous MultiTOS dans le fichier MINT.CNF ou sous NAES 
          dans le fichier NAES.CNF :<br>
          setenv BROWSER=C:\CAB\CAB.APP</p>
      </div></td>
  </tr>
  <tr> 
    <td height="19" valign="top" class="petis-12-Gras">&nbsp;</td>
    <td height="19" valign="middle" class="petis-12"><div align="center"><img src="../../Images/Atabandeau.jpg" width="517" height="1"></div></td>
  </tr>
  <tr> 
    <td width="1%" height="27" valign="top" class="petis-12-Gras"> <div align="center"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></div></td>
    <td width="99%" valign="top" class="petis-12"><div align="justify"><span class="petis-12-Bleu">Nouvelle 
        version 1.30</span> (juin 2002)<br>
        <span class="petis-12-Soulign&eacute;">Correction des bugs suivants :</span><br>
        Redraw correct des fen&ecirc;tres de l'application sous Magic.<br>
        Redraw correct de la barre de la fen&ecirc;tre principale lors d'un d&eacute;placement.<br>
        R&eacute;&eacute;criture des routines ICONIFY et ALLICONIFY.<br>
        Affichage correct des barres des fen&ecirc;tres des autres applications 
        en mode multitache.<br>
        Le programme n'est plus bloquant en mode multitache.<br>
        Le programme fonctionne maintenant dans tous les modes graphiques (1 bit 
        au 32 bits).<br>
        Les allocations m&eacute;moire sont d&eacute;sormais correctes. Merci 
        &agrave; Eric REBOUX pour le programme MEMDEBUG.<br>
        <br>
        <span class="petis-12-Soulign&eacute;">Nouveaut&eacute;s:</span><br>
        Support des ic&ocirc;nes au format XPM (Linux).<br>
        Support du protocole DRAG and DROP vers INTERFACE.<br>
        Support du DRAG and DROP d'un fichier sur l'ic&ocirc;ne du programme sous 
        TOS, Mint et Magic.<br>
        Possibilit&eacute; d'associer les fichiers ICO, CUR, ANI, ICL, DLL et 
        XPM au programme (Newdesk, Jinnee, Thing...).<br>
        Support du protocole AV vers ZOOM, RSM et INTERFACE.<br>
        Support des noms longs de fichier sous Magic et Mint.<br>
        Utilisation des routines NVDI 5.xx pour le transfert d'une ic&ocirc;ne 
        8 bit en mode 4 et 1 bit (tramage possible).<br>
        Th&egrave;me de bureau et de fen&ecirc;tres personnalisables.<br>
        Possibilit&eacute; de voir les fichiers RSC en 256, 16 et 2 couleurs.<br>
        Possibilit&eacute; de supprimer la fen&ecirc;tre de traitement afin d'utiliser 
        un autre programme en mode multitache.<br>
        Nouvelle fen&ecirc;tre d'information sur le mat&eacute;riel et le mode 
        vid&eacute;o utilis&eacute;.<br>
        Nouveau fichier pour ST-Guide.<br>
        Par d&eacute;faut, le fichier pour ST-Guide est lu depuis le r&eacute;pertoire 
        d'ICON Extract, sinon dans le r&eacute;pertoire des fichiers HYP sp&eacute;cifi&eacute; 
        dans le fichier ST-GUIDE.INF.<br>
        Nouveaux fichiers de configuration (incorporation des th&egrave;mes de 
        bureau et de fen&ecirc;tre).</div></td>
  </tr>
  <tr> 
    <td height="19" valign="top" class="petis-12-Gras">&nbsp;</td>
    <td height="19" valign="middle" class="petis-12"> <div align="center"><img src="../../Images/Atabandeau.jpg" width="517" height="1"></div></td>
  </tr>
  <tr> 
    <td height="27" valign="top" class="petis-12-Gras"><div align="center"><span class="petis-12-Gras"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></span></div></td>
    <td valign="top" class="petis-12"><div align="justify"><span class="petis-12-Bleu">Nouvelle 
        version 1.20</span> (septembre 2001)<br>
        <span class="petis-12-Soulign&eacute;">Correction des bugs suivants :</span><br>
        Affichage correct de l'interface en mode monochrome.<br>
        Redessin des ic&ocirc;nes de l'interface en mode monochrome et 16 couleurs.<br>
        <br>
        <span class="petis-12-Soulign&eacute;">Nouveaut&eacute;s:</span><br>
        Support des ic&ocirc;nes en 32 bits (conversion en 256 couleurs). </div></td>
  </tr>
  <tr> 
    <td height="19" valign="top" class="petis-12-Gras">&nbsp;</td>
    <td height="19" valign="middle" class="petis-12"> <div align="center"><img src="../../Images/Atabandeau.jpg" width="517" height="1"></div></td>
  </tr>
  <tr> 
    <td height="787" valign="top" class="petis-12-Gras"> <div align="center"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></div></td>
    <td valign="top" class="petis-12"><div align="justify"><span class="petis-12-Bleu">Nouvelle 
        version 1.10 </span>(juillet 2001)<br>
        <span class="petis-12-Soulign&eacute;">Correction des bugs suivants:</span><br>
        Traitement correct des ic&ocirc;nes monochromes en mode 2, 4 et 8 bits.<br>
        Traitement correct des ic&ocirc;nes 4 bits en mode 8 bits.<br>
        Affichage correct des titres des fen&ecirc;tres (avec l'ic&ocirc;ne associ&eacute;e) 
        lors de l'utilisation du protocole XGEM (test de la version).<br>
        Cr&eacute;ation de plus de 10 fichiers RSC.<br>
        Suppression du test de la fen&ecirc;tre en premier plan dans la routine 
        evnt_multi qui posait probl&egrave;me (&eacute;cran et clavier fig&eacute;s) 
        sur un Falcon 030 de base et le TT.<br>
        Suppression de l'appel vst_load_font() pour l'affichage des textes des 
        objets Userdefs en 3D. Celui-ci &eacute;tait inutile.<br>
        Suppression de tous les appels &agrave; v_curradress() qui &eacute;taient 
        inutiles et qui faisaientt dans certain cas crasher le syst&egrave;me.<br>
        Les routines de gestion des fen&ecirc;tres ne sont plus compil&eacute;es 
        avec l'option 68881-2.<br>
        Dans le cas o&ugrave; une ic&ocirc;ne existe seulement en monochrome et 
        en 256 couleurs, l'ic&ocirc;ne en 16 couleurs qui sera calcul&eacute;e 
        le sera &agrave; partir de celle en 8 bit et non plus celle en 1 bit.<br>
        Routine ICL to ICO (version 1.1)<br>
        Modification de la taille des buffers (maximum 2000 ic&ocirc;nes par fichier 
        ICL).<br>
        Modification de la routine pour accepter des fichiers ICL &quot;corrompus&quot;. 
        Ce probl&egrave;me est apparu avec le fichier OSX.ICL (plus de 11 Mo) 
        o&ugrave; les en-t&ecirc;tes ICO ne correspondaient pas avec les structures 
        datas. Le fichier SIGNS.ICL (donn&eacute; dans l'archive du LBC) est lui 
        aussi trait&eacute; correctement. </div>
      <p align="justify"><span class="petis-12-Soulign&eacute;">Nouveaut&eacute;s:</span><br>
        Support des ic&ocirc;nes en 24 bits (conversion en 256 couleurs).<br>
        Support des ic&ocirc;nes en 72x72, 96x96 et 128x128 pixels.<br>
        Choix de l'ic&ocirc;ne &agrave; conserver en cas de doublons 8-24 bits.<br>
        Deux m&eacute;thodes de recalcul de la palette 256 couleurs pour les ic&ocirc;nes 
        en 8 et 24 bits :<br>
        - m&eacute;thode 1 : calcul approximatif (rapide).<br>
        - m&eacute;thode 2 : calcul pr&eacute;cis (plus lent).<br>
        Impossibilit&eacute; d'activer le bouton REPERTOIRE par la touche ENTREE 
        lors d'une recherche sur un fichier.<br>
        Possibilit&eacute; d'arr&ecirc;ter le traitement en cours sur les ic&ocirc;nes 
        d'un r&eacute;pertoire par la touche ESC. Une boite de dialogue s'affichera 
        &agrave; la fin de l'ic&ocirc;ne en traitement pour confirmer ou non cet 
        arr&ecirc;t.<br>
        La routine pour le traitement des fichiers ANI teste la pr&eacute;sence 
        d&#8217;un r&eacute;pertoire au m&ecirc;me nom que le fichier ANI &agrave; 
        traiter.<br>
        Lecture et sauvegarde de plusieurs configurations (fichiers CFG).<br>
        Lecture automatique au lancement du programme du fichier EXTRACT.CFG s'il 
        existe.<br>
        Lors d'un nouveau traitement d'ic&ocirc;nes, le s&eacute;lecteur de fichier 
        s'ouvre automatiquement dans le dernier r&eacute;pertoire consult&eacute;.<br>
        Lors de la sauvegarde des fichiers RSC, il y a un test pour conna&icirc;tre 
        l'espace disponible sur le lecteur concern&eacute;. Si celui n'est pas 
        suffisant, le s&eacute;lecteur de fichier appara&icirc;t pour choisir 
        un autre chemin de sauvegarde.<br>
        Refonte de la routine de pr&eacute;paration de l'&eacute;criture des fichiers 
        RSC.<br>
        Les noms des ic&ocirc;nes des fichiers RSC sont nomm&eacute;s de EXTRACT 
        001 &agrave; EXTRACT 099 au lieu de ICO EXTRACT ou CUR EXTRACT.<br>
        <br>
        <span class="petis-12-Soulign&eacute;">Ordinateurs sur lesquels Icon Extract 
        1.1 a &eacute;t&eacute; test&eacute; et fonctionne :</span><br>
        - Falcon de base TOS 4.02 16 Mhz 14 Mo de ST Ram.<br>
        - Falcon avec CT2 B TOS 4.04 14 Mo de ST Ram + 32 Mo de TT Ram + coprocesseur 
        68882.<br>
        - Milan 040<br>
        - Atari TT<br>
        - PC Pentium III 866 Mhz avec Magic PC 6.10.<br>
        - Imac avec Magic Mac 6.10.</p>
      <p align="justify"><span class="petis-12-Soulign&eacute;">Important :</span><br>
        Du fait des tr&egrave;s nombreux calculs de r&eacute;indexation des palettes 
        couleurs (mode 8 et 24 bits) il est recommand&eacute; d'utiliser un ordinateur 
        puissant. Soit au minimum un Falcon 030 avec un coprocesseur arithm&eacute;tique.</p></td>
  </tr>
  <tr> 
    <td height="19" valign="top" class="petis-12-Gras">&nbsp;</td>
    <td height="19" valign="middle" class="petis-12"> <div align="center"><img src="../../Images/Atabandeau.jpg" width="517" height="1"></div></td>
  </tr>
  <tr> 
    <td height="27" valign="top" class="petis-12-Gras"><div align="center"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></div></td>
    <td valign="top" class="petis-12"><div align="justify">(avril 2001)<br>
        Correction du bug dans le mode True Color du Falcon 030. L'ic&ocirc;ne 
        est d&eacute;sormais parfaitement dessin&eacute;e. Le probl&egrave;me 
        de la palette n'est pas tout &agrave; fait r&eacute;solu. Les 256 premi&egrave;res 
        couleurs ne sont pas celles du mode 8 bits.<br>
        L'installation du programme se fait d&eacute;sormais gr&acirc;ce &agrave; 
        GEMSetup version 2.01. Le script au format XML permet en outre d'installer 
        des exemples pour Icon Extract et les programmes Bubble GEM et ST Guide 
        si vous ne les poss&eacute;dez pas. <br>
        Correction du bug de superposition du masque et des donn&eacute;es lors 
        de l'utilisation du mode 256 couleurs sur Magic Mac et Magic PC. </div></td>
  </tr>
  <tr> 
    <td height="19" valign="top" class="petis-12-Gras">&nbsp;</td>
    <td height="19" valign="middle" class="petis-12"> <div align="center"><img src="../../Images/Atabandeau.jpg" width="517" height="1"></div></td>
  </tr>
  <tr> 
    <td height="337" valign="top" class="petis-12-Gras"><div align="center"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></div></td>
    <td valign="top" class="petis-12"><div align="justify">(mars 2001)<br>
        Pour chaque ic&ocirc;ne des fichiers RSC, il y a d&eacute;sormais une 
        structure CICON en 2, 16 et 256 couleurs. Si les ic&ocirc;nes des fichiers 
        ICO ou CUR sont inscrites en un seul mode (1, 4 ou 8 bits), il y a transfert 
        de plans MFDB pour les structures CICON restantes. <br>
        <br>
        <span class="petis-12-Soulign&eacute;">Exemple :</span><br>
        Ic&ocirc;ne d'un fichier ICO ou CUR en 256 couleurs : CICON en 256 couleurs 
        (8 bits) cr&eacute;&eacute; automatiquement.<br>
        &eacute;criture du premier plan pour la structure CICON en 2 couleurs 
        (1 bit), puis des quatres premiers plans pour la CICON en 16 couleurs 
        (4 bits). </div>
      <p align="justify">Ic&ocirc;ne d'un fichier ICO ou CUR en 16 couleurs : 
        CICON en 16 couleurs (4 bits) cr&eacute;&eacute; automatiquement.<br>
        &eacute;criture du premier plan pour la structure CICON en 2 couleurs 
        (1 bit), &eacute;criture des quatres premiers plans et calcul des quatres 
        plans restants pour la CICON en 256 couleurs (8 bits).</p>
      <p align="justify">Ic&ocirc;ne d'un fichier ICO ou CUR en 2 couleurs : CICON 
        en 2 couleurs (1 bit) cr&eacute;&eacute; automatiquement.<br>
        &eacute;criture du premier plan et calcul des 3 plans restants pour la 
        structure CICON en 16 couleurs (4 bits), &eacute;criture du premier plan 
        et calcul des 7 autres plans pour la structure CICON en 256 couleurs (8 
        bits) </p>
      <p align="justify">Les allocations m&eacute;moires des ic&ocirc;nes se font 
        d&eacute;sormais avec des appels du type &quot;calloc()&quot; et non malloc(). 
        De cette mani&egrave;re les espaces m&eacute;moires r&eacute;serv&eacute;es 
        sont bien initialis&eacute;s, puis ensuite lib&eacute;r&eacute;s &agrave; 
        la fin du programme.</p>
      <p align="justify">Support du protocole XGEM pour Magic de Eric Reboux </p></td>
  </tr>
  <tr> 
    <td height="19" valign="top" class="petis-12-Gras">&nbsp;</td>
    <td height="19" valign="middle" class="petis-12"><div align="center"><img src="../../Images/Atabandeau.jpg" width="517" height="1"></div></td>
  </tr>
  <tr> 
    <td height="27" valign="top" class="petis-12-Gras"><div align="center"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></div></td>
    <td valign="top" class="petis-12"><div align="justify">(f&eacute;vrier 2001)<br>
        Recherche sur Internet des sp&eacute;cifications des fichiers ANI (Animated 
        File de Windows). D&eacute;couverte d'une note sur les structures de type 
        RAW. Cr&eacute;ation de la routine d'extraction. Comme pour les fichiers 
        ICL, un r&eacute;pertoire du nom du fichier trait&eacute; est cr&eacute;&eacute; 
        pour l'enregistrement des fichiers ICO ou CUR (exemple : WHEEL.ANI - r&eacute;pertoire 
        WHELL). Les fichiers ICO sont ensuite trait&eacute;s et int&eacute;gr&eacute;s 
        dans un fichier RSC comme indiqu&eacute; pr&eacute;c&eacute;demment. </div></td>
  </tr>
  <tr> 
    <td height="19" valign="top" class="petis-12-Gras">&nbsp;</td>
    <td height="19" valign="middle" class="petis-12"> <div align="center"><img src="../../Images/Atabandeau.jpg" width="517" height="1"></div></td>
  </tr>
  <tr> 
    <td height="27" valign="top" class="petis-12-Gras"><div align="center"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></div></td>
    <td valign="top" class="petis-12"><div align="justify">(janvier 2001)<br>
        Certains fichiers DLL (Dynamic Link Library de Windows) sont trait&eacute;s, 
        seulement avec un en-t&ecirc;te NE, les type PE ne sont pas encore support&eacute;s. 
        Toutes les ic&ocirc;nes du c&eacute;l&egrave;bre fichier MORICON.DLL de 
        Windows sont extra&icirc;tes.</div></td>
  </tr>
  <tr> 
    <td height="19" valign="top" class="petis-12-Gras">&nbsp;</td>
    <td height="19" valign="middle" class="petis-12"><div align="center"><img src="../../Images/Atabandeau.jpg" width="517" height="1"></div></td>
  </tr>
  <tr> 
    <td height="27" valign="top" class="petis-12-Gras"><div align="center"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></div></td>
    <td valign="top" class="petis-12"><div align="justify">(d&eacute;cembre 2000)<br>
        Recherche sur Internet des sp&eacute;cifications des fichiers ICL (Icon 
        Library de Windows). Malheureusement rien n'existe. Je suis oblig&eacute; 
        de faire des tests et sortir le tout sur papier gr&agrave;ce &agrave; 
        un &eacute;diteur h&eacute;xad&eacute;cimal. Visiblement, cela ressemble 
        &agrave; la structure des fichiers EXE ou DLL avec seulement une partie 
        ressource. Au bout de plusieurs semaines, je finis par finaliser une routine 
        permetant l'extraction de toutes les ic&ocirc;nes au format ICO dans un 
        r&eacute;pertoire cr&eacute;&eacute; au nom du fichier ICL (exemple : 
        WHISTLER.ICL - r&eacute;pertoire WHISTLER) et cela en 3 passes. </div>
      <p align="justify">Passe n&deg;1 : Lecture des offsets des ressources et 
        de leurs noms.<br>
        Passe n&deg;2 : Lecture des offsets des structures ICO et correction de 
        leur taille (merci Windows). Padding sur 32 bits et &eacute;criture des 
        fichiers ICO avec seulement leur en-t&ecirc;te.<br>
        Passe n&deg;3 : Lecture des datas au format ICO et &eacute;criture finale 
        des fichiers ICO.</p>
      <p align="justify">Les fichiers ICO sont ensuite trait&eacute;s et int&eacute;gr&eacute;s 
        dans un fichier RSC comme indiqu&eacute; pr&eacute;c&eacute;demment.</p></td>
  </tr>
  <tr> 
    <td height="19" valign="top" class="petis-12-Gras">&nbsp;</td>
    <td height="19" valign="middle" class="petis-12"> <div align="center"><img src="../../Images/Atabandeau.jpg" width="517" height="1"></div></td>
  </tr>
  <tr> 
    <td height="27" valign="top" class="petis-12-Gras"><div align="center"> 
        <p><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></p>
      </div></td>
    <td valign="top" class="petis-12"><div align="justify">(novembre 2000)<br>
        Les fichiers CUR (Cursor File de Windoxs) sont enfin trait&eacute;s. La 
        deuxi&egrave;me version en mode texte fonctionne automatiquement et permet 
        de scanner toutes les fichiers ICO ou CUR d'un r&eacute;pertoire et effectue 
        la cr&eacute;ation des fichiers RSC (ICO16-xx.RSC, ICO32-xx.RSC, ICO48-xx.RSC, 
        ICO64-xx.RSC, ICO72-xx.RSC ou CUR16-xx,RSC, CUR32-xx,RSC, CUR48-xx,RSC, 
        CUR64-xx,RSC, CUR72-xx,RSC). La valeur &quot;xx&quot; repr&eacute;sente 
        le num&eacute;ro du fichier cr&eacute;&eacute; (de 01 &agrave; 99).<br>
        Premi&egrave;re version avec interface AES et cr&eacute;ation de nouveaux 
        objets Userdefs (fond d'&eacute;cran et de fen&ecirc;tres, boutons et 
        barres de progression). </div></td>
  </tr>
  <tr> 
    <td height="19" valign="top" class="petis-12-Gras">&nbsp;</td>
    <td height="19" valign="middle" class="petis-12"><div align="center"><img src="../../Images/Atabandeau.jpg" width="517" height="1"></div></td>
  </tr>
  <tr> 
    <td height="27" valign="top" class="petis-12-Gras"><div align="center"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></div></td>
    <td valign="top" class="petis-12"><div align="justify">(octobre 2000)<br>
        La routine de cr&eacute;ation d'un fichier ressource fonctionne mais avec 
        un maximum de 99 ic&ocirc;nes.<br>
        Toutes les ic&ocirc;nes d'un fichier ICO sont d&eacute;sormais extraites 
        quelque soit leurs tailles (16x16, 32x32, 48x18, 64x64, 72x72 pixels) 
        en 2, 16 et 256 couleurs. En mode 8 bits, une comparaison est r&eacute;alis&eacute;e 
        entre la palette des ic&ocirc;nes des fichiers ICO avec celle de l'ATARI 
        pour conna&icirc;tre la valeur RVB la plus proche. Possibilit&eacute; 
        de choisir la palette du Falcon 030, de NVDI ou celle en cours.</div></td>
  </tr>
  <tr> 
    <td height="19" valign="top" class="petis-12-Gras">&nbsp;</td>
    <td height="19" valign="middle" class="petis-12"><div align="center"><img src="../../Images/Atabandeau.jpg" width="517" height="1"></div></td>
  </tr>
  <tr> 
    <td height="27" valign="top" class="petis-12-Gras"><div align="center"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></div></td>
    <td valign="top" class="petis-12"><div align="justify">(septembre 2000)<br>
        Projet de cr&eacute;ation d'Icon Extract. Recherche sur Internet des sp&eacute;cifications 
        sur les fichiers ICO et CUR du monde Windows.<br>
        Premi&egrave;re version en mode texte (sans interface AES). Les icones 
        des fichiers ICO sont bien extraites et transf&eacute;r&eacute;es au format 
        VDI MFDB.<br>
        Premi&egrave;res &eacute;tudes sur le format RSC type 4 d'ATARI pour la 
        sauvegarde des ic&ocirc;nes couleurs. </div></td>
  </tr>
  <tr> 
    <td height="27" valign="top" class="petis-12-Gras">&nbsp;</td>
    <td valign="top" class="petis-12">&nbsp;</td>
  </tr>
  <tr> 
    <td height="27" valign="top" class="petis-12-Gras"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></td>
    <td valign="middle" class="petis-12"><a href="Prog.htm" target="_parent">Page 
      suivante</a></td>
  </tr>
  <tr> 
    <td height="27" valign="top" class="petis-12-Gras"><img src="../../../Images/Bleu.jpg" width="25" height="25" align="absmiddle"></td>
    <td valign="middle" class="petis-12"><a href="../Index.htm" target="_parent">Retour 
      au menu</a></td>
  </tr>
</table>
</body>
</html>
